{
  "patterns": [
    {
      "title": "Head and Shoulders",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/head-and-shoulders.svg",
      "descriptions": [
        "Pola Head and Shoulders adalah pola yang terdiri dari tiga puncak, dengan puncak tengah (kepala) lebih tinggi dari dua puncak samping (bahu). Pola ini mengindikasikan potensi pembalikan tren dari tren naik ke tren turun. Puncak bahu kiri dan bahu kanan biasanya memiliki tinggi yang sekitar sama. Pola ini bisa menjadi sinyal bahwa pembeli mulai kehilangan kendali, dan penjual mungkin akan mengambil alih."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d41",
        "651013ae4aa970361cbc6d42",
        "651013ae4aa970361cbc6d43",
        "651013ae4aa970361cbc6d44",
        "651013ae4aa970361cbc6d45"
      ]
    },
    {
      "title": "Inverse Head and Shoulders",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/inverse-head-and-shoulders.svg",
      "descriptions": [
        "Pola Inverted Head and Shoulders adalah kebalikan dari pola Head and Shoulders. Ini terdiri dari tiga puncak, dengan puncak tengah (kepala) lebih rendah dari dua puncak samping (bahu). Pola ini dapat diartikan sebagai sinyal potensial pembalikan tren dari tren turun ke tren naik, dan sering dianggap sebagai indikator bullish. Ini bisa menjadi tanda bahwa penjual kehilangan kendali, dan pembeli mungkin akan mengambil alih."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d46",
        "651013ae4aa970361cbc6d47",
        "651013ae4aa970361cbc6d48",
        "651013ae4aa970361cbc6d49",
        "651013ae4aa970361cbc6d4a"
      ]
    },
    {
      "title": "Double Top",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/double-top.svg",
      "descriptions": [
        "Pola Double Top terbentuk ketika harga mencapai dua puncak yang hampir sejajar dalam pergerakan harga, dengan puncak kedua sedikit lebih rendah dari puncak pertama. Pola ini mencerminkan tekanan jual yang kuat dan merupakan indikasi potensi pembalikan tren turun. Dengan kata lain, pola ini mengisyaratkan bahwa tren naik yang kuat mungkin telah mencapai puncaknya dan harga saham kemungkinan akan mengalami penurunan. Trader sering melihat pola Double Top sebagai sinyal untuk menjual saham atau mengambil posisi short."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d4b",
        "651013ae4aa970361cbc6d4c",
        "651013ae4aa970361cbc6d4d",
        "651013ae4aa970361cbc6d4e",
        "651013ae4aa970361cbc6d4f"
      ]
    },
    {
      "title": "Double Bottom",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/double-bottom.svg",
      "descriptions": [
        "Pola Double Bottom terjadi ketika harga mencapai dua dasar yang hampir sejajar dalam pergerakan harga, dengan dasar kedua sedikit lebih tinggi dari dasar pertama. Pola ini mencerminkan tekanan beli yang kuat dan merupakan indikasi potensi pembalikan tren naik. Artinya, pola ini mengisyaratkan bahwa tren turun yang kuat mungkin telah mencapai dasarnya dan harga saham kemungkinan akan mengalami kenaikan. Oleh karena itu, trader sering melihat pola Double Bottom sebagai sinyal untuk membeli saham atau mengambil posisi long."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d50",
        "651013ae4aa970361cbc6d51",
        "651013ae4aa970361cbc6d52",
        "651013ae4aa970361cbc6d53",
        "651013ae4aa970361cbc6d54"
      ]
    },
    {
      "title": "Bearish Flag",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/bearish-flag.svg",
      "descriptions": [
        "Pola Bearish Flag terjadi setelah tren naik yang kuat. Pola ini terlihat seperti bendera dengan tiang yang menunjukkan tren naik sebelumnya dan koreksi harga yang relatif pendek yang bergerak secara horizontal atau sedikit turun. Bentuknya seperti segitiga yang menurun atau lurus dengan garis miring ke bawah. Pola Bearish Flag adalah sinyal bahwa tren naik mungkin akan melanjutkan pergerakannya setelah koreksi harga singkat. Ini mengindikasikan bahwa penjual masih dominan meskipun terjadi koreksi harga. Trader sering mencari peluang sell saat harga keluar dari pola ini ke bawah."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d55",
        "651013ae4aa970361cbc6d56",
        "651013ae4aa970361cbc6d57",
        "651013ae4aa970361cbc6d58",
        "651013ae4aa970361cbc6d59"
      ]
    },
    {
      "title": "Bullish Flag",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/bullish-flag.svg",
      "descriptions": [
        "Pola Bullish Flag juga terjadi setelah tren naik yang kuat. Pola ini terlihat seperti bendera dengan tiang yang menunjukkan tren naik sebelumnya dan koreksi harga yang relatif pendek yang bergerak secara horizontal atau sedikit naik. Bentuknya mirip dengan segitiga naik atau lurus dengan garis miring ke atas. Pola Bullish Flag adalah sinyal bahwa tren naik mungkin akan melanjutkan pergerakannya setelah koreksi harga singkat. Ini mengindikasikan bahwa pembeli masih dominan meskipun terjadi koreksi harga. Trader sering mencari peluang buy saat harga keluar dari pola ini ke atas."
      ],
      "questionIds": [
        "651013ae4aa970361cbc6d5a",
        "651013ae4aa970361cbc6d5b",
        "651013ae4aa970361cbc6d5c",
        "651013ae4aa970361cbc6d5d",
        "651013ae4aa970361cbc6d5e"
      ]
    },
    {
      "title": "Cup and Handle",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/cup-and-handle.svg",
      "descriptions": [
        "Pola ini diberi nama \"Cup and Handle\" karena bentuknya mirip dengan cangkir yang diikuti oleh pegangan. Fase pertama dari pola ini disebut \"Cup\" (cangkir). Selama fase ini, harga saham mengalami penurunan yang signifikan, menciptakan bentuk seperti cangkir atau mangkuk. Ini adalah periode di mana tekanan jual mungkin telah berakhir, dan pembeli mulai mengambil alih. Harga bergerak perlahan ke atas setelah mencapai dasarnya, menunjukkan adanya momentum kenaikan Fase kedua dari pola ini disebut \"Handle\" (pegangan). Ini adalah periode konsolidasi harga setelah pembentukan cangkir. Pegangan biasanya terlihat sebagai penurunan harga yang lebih datar atau pergerakan harga yang bergerak mendatar. Ini adalah waktu ketika trader dan investor mengamati apakah tren naik akan berlanjut. Pola Cup and Handle dianggap sebagai sinyal bullish, yang berarti bahwa harga saham atau aset kemungkinan akan melanjutkan tren naiknya. Trader mencari peluang untuk membeli saham atau aset saat harga keluar dari atas pola Cup and Handle. Ini mengindikasikan bahwa pembeli masih aktif dan ada potensi kenaikan harga lebih lanjut."
      ],
      "questionIds": [
        "65183ac110607d1999954b44",
        "65183ac110607d1999954b45",
        "65183ac110607d1999954b46",
        "65183ac110607d1999954b47",
        "65183ac110607d1999954b48"
      ]
    },
    {
      "title": "Inverse Cup and Handle",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/inverse-cup-and-handle.svg",
      "descriptions": [
        "Pola Inverse Cup and Handle adalah pola penting dalam analisis teknikal yang sering digunakan oleh trader dan investor untuk mengidentifikasi potensi pembalikan tren harga saham atau aset. Pola ini terdiri dari dua fase: fase pertama adalah \"Inverse Cup\" yang menggambarkan kenaikan harga yang tajam, menciptakan bentuk cangkir terbalik, menandakan dominasi pembeli, dan fase kedua adalah \"Handle\" yang merupakan periode konsolidasi harga setelah kenaikan tersebut. Pola ini dianggap sebagai sinyal bearish, mengindikasikan potensi pembalikan dari tren naik menjadi tren turun. Setelah terbentuk, trader mencari peluang menjual saham atau aset saat harga keluar dari bawah pola Inverse Cup and Handle, mengisyaratkan kemungkinan dominasi penjual dan kelanjutan tren turun. "
      ],
      "questionIds": [
        "65183ac110607d1999954b49",
        "65183ac110607d1999954b4a",
        "65183ac110607d1999954b4b",
        "65183ac110607d1999954b4c",
        "65183ac110607d1999954b4d"
      ]
    },
    {
      "title": "Bullish Pennant",
      "imageUrl": "https://ik.imagekit.io/lutfiandri/stockmaster/patterns/bullish-pennant.svg",
      "descriptions": [
        "Pola Bullish Pennant terbentuk setelah tren naik yang kuat. Pola ini mirip dengan bendera, dengan tiang menunjukkan tren naik sebelumnya dan koreksi harga yang pendek yang bergerak secara horizontal. Secara visual, pola ini terlihat seperti segitiga yang menurun atau lurus dengan garis miring ke bawah. Bullish Pennant adalah sinyal bahwa tren naik mungkin akan berlanjut setelah koreksi harga singkat. Trader mencari peluang untuk membeli saham atau aset saat harga keluar dari atas pola Bullish Pennant, mengindikasikan bahwa pembeli masih dominan dan ada potensi kenaikan harga lebih lanjut."
      ],
      "questionIds": [
        "65183ac110607d1999954b4e",
        "65183ac110607d1999954b4f",
        "65183ac110607d1999954b50",
        "65183ac110607d1999954b51",
        "65183ac110607d1999954b52"
      ]
    }
  ]
}
